espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_iomux_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LP_IOMUX_CLK_EN_REG register
 *  Reserved
 */
#define LP_IOMUX_CLK_EN_REG (DR_REG_LP_IOMUX_BASE + 0x0)
/** LP_IOMUX_REG_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Reserved
 */
#define LP_IOMUX_REG_CLK_EN    (BIT(0))
#define LP_IOMUX_REG_CLK_EN_M  (LP_IOMUX_REG_CLK_EN_V << LP_IOMUX_REG_CLK_EN_S)
#define LP_IOMUX_REG_CLK_EN_V  0x00000001U
#define LP_IOMUX_REG_CLK_EN_S  0

/** LP_IOMUX_VER_DATE_REG register
 *  Reserved
 */
#define LP_IOMUX_VER_DATE_REG (DR_REG_LP_IOMUX_BASE + 0x4)
/** LP_IOMUX_REG_VER_DATE : R/W; bitpos: [27:0]; default: 2294547;
 *  Reserved
 */
#define LP_IOMUX_REG_VER_DATE    0x0FFFFFFFU
#define LP_IOMUX_REG_VER_DATE_M  (LP_IOMUX_REG_VER_DATE_V << LP_IOMUX_REG_VER_DATE_S)
#define LP_IOMUX_REG_VER_DATE_V  0x0FFFFFFFU
#define LP_IOMUX_REG_VER_DATE_S  0

/** LP_IOMUX_PAD0_REG register
 *  Reserved
 */
#define LP_IOMUX_PAD0_REG (DR_REG_LP_IOMUX_BASE + 0x8)
/** LP_IOMUX_REG_PAD0_DRV : R/W; bitpos: [1:0]; default: 2;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD0_DRV    0x00000003U
#define LP_IOMUX_REG_PAD0_DRV_M  (LP_IOMUX_REG_PAD0_DRV_V << LP_IOMUX_REG_PAD0_DRV_S)
#define LP_IOMUX_REG_PAD0_DRV_V  0x00000003U
#define LP_IOMUX_REG_PAD0_DRV_S  0
/** LP_IOMUX_REG_PAD0_RDE : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD0_RDE    (BIT(2))
#define LP_IOMUX_REG_PAD0_RDE_M  (LP_IOMUX_REG_PAD0_RDE_V << LP_IOMUX_REG_PAD0_RDE_S)
#define LP_IOMUX_REG_PAD0_RDE_V  0x00000001U
#define LP_IOMUX_REG_PAD0_RDE_S  2
/** LP_IOMUX_REG_PAD0_RUE : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD0_RUE    (BIT(3))
#define LP_IOMUX_REG_PAD0_RUE_M  (LP_IOMUX_REG_PAD0_RUE_V << LP_IOMUX_REG_PAD0_RUE_S)
#define LP_IOMUX_REG_PAD0_RUE_V  0x00000001U
#define LP_IOMUX_REG_PAD0_RUE_S  3
/** LP_IOMUX_REG_PAD0_MUX_SEL : R/W; bitpos: [4]; default: 0;
 *  1:use LP GPIO,0: use digital GPIO
 */
#define LP_IOMUX_REG_PAD0_MUX_SEL    (BIT(4))
#define LP_IOMUX_REG_PAD0_MUX_SEL_M  (LP_IOMUX_REG_PAD0_MUX_SEL_V << LP_IOMUX_REG_PAD0_MUX_SEL_S)
#define LP_IOMUX_REG_PAD0_MUX_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD0_MUX_SEL_S  4
/** LP_IOMUX_REG_PAD0_FUN_SEL : R/W; bitpos: [6:5]; default: 0;
 *  function sel
 */
#define LP_IOMUX_REG_PAD0_FUN_SEL    0x00000003U
#define LP_IOMUX_REG_PAD0_FUN_SEL_M  (LP_IOMUX_REG_PAD0_FUN_SEL_V << LP_IOMUX_REG_PAD0_FUN_SEL_S)
#define LP_IOMUX_REG_PAD0_FUN_SEL_V  0x00000003U
#define LP_IOMUX_REG_PAD0_FUN_SEL_S  5
/** LP_IOMUX_REG_PAD0_SLP_SEL : R/W; bitpos: [7]; default: 0;
 *  1: enable sleep mode during sleep,0: no sleep mode
 */
#define LP_IOMUX_REG_PAD0_SLP_SEL    (BIT(7))
#define LP_IOMUX_REG_PAD0_SLP_SEL_M  (LP_IOMUX_REG_PAD0_SLP_SEL_V << LP_IOMUX_REG_PAD0_SLP_SEL_S)
#define LP_IOMUX_REG_PAD0_SLP_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD0_SLP_SEL_S  7
/** LP_IOMUX_REG_PAD0_SLP_IE : R/W; bitpos: [8]; default: 0;
 *  input enable in sleep mode
 */
#define LP_IOMUX_REG_PAD0_SLP_IE    (BIT(8))
#define LP_IOMUX_REG_PAD0_SLP_IE_M  (LP_IOMUX_REG_PAD0_SLP_IE_V << LP_IOMUX_REG_PAD0_SLP_IE_S)
#define LP_IOMUX_REG_PAD0_SLP_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD0_SLP_IE_S  8
/** LP_IOMUX_REG_PAD0_SLP_OE : R/W; bitpos: [9]; default: 0;
 *  output enable in sleep mode
 */
#define LP_IOMUX_REG_PAD0_SLP_OE    (BIT(9))
#define LP_IOMUX_REG_PAD0_SLP_OE_M  (LP_IOMUX_REG_PAD0_SLP_OE_V << LP_IOMUX_REG_PAD0_SLP_OE_S)
#define LP_IOMUX_REG_PAD0_SLP_OE_V  0x00000001U
#define LP_IOMUX_REG_PAD0_SLP_OE_S  9
/** LP_IOMUX_REG_PAD0_FUN_IE : R/W; bitpos: [10]; default: 0;
 *  input enable in work mode
 */
#define LP_IOMUX_REG_PAD0_FUN_IE    (BIT(10))
#define LP_IOMUX_REG_PAD0_FUN_IE_M  (LP_IOMUX_REG_PAD0_FUN_IE_V << LP_IOMUX_REG_PAD0_FUN_IE_S)
#define LP_IOMUX_REG_PAD0_FUN_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD0_FUN_IE_S  10
/** LP_IOMUX_REG_PAD0_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IOMUX_REG_PAD0_FILTER_EN    (BIT(11))
#define LP_IOMUX_REG_PAD0_FILTER_EN_M  (LP_IOMUX_REG_PAD0_FILTER_EN_V << LP_IOMUX_REG_PAD0_FILTER_EN_S)
#define LP_IOMUX_REG_PAD0_FILTER_EN_V  0x00000001U
#define LP_IOMUX_REG_PAD0_FILTER_EN_S  11

/** LP_IOMUX_PAD1_REG register
 *  Reserved
 */
#define LP_IOMUX_PAD1_REG (DR_REG_LP_IOMUX_BASE + 0xc)
/** LP_IOMUX_REG_PAD1_DRV : R/W; bitpos: [1:0]; default: 2;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD1_DRV    0x00000003U
#define LP_IOMUX_REG_PAD1_DRV_M  (LP_IOMUX_REG_PAD1_DRV_V << LP_IOMUX_REG_PAD1_DRV_S)
#define LP_IOMUX_REG_PAD1_DRV_V  0x00000003U
#define LP_IOMUX_REG_PAD1_DRV_S  0
/** LP_IOMUX_REG_PAD1_RDE : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD1_RDE    (BIT(2))
#define LP_IOMUX_REG_PAD1_RDE_M  (LP_IOMUX_REG_PAD1_RDE_V << LP_IOMUX_REG_PAD1_RDE_S)
#define LP_IOMUX_REG_PAD1_RDE_V  0x00000001U
#define LP_IOMUX_REG_PAD1_RDE_S  2
/** LP_IOMUX_REG_PAD1_RUE : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD1_RUE    (BIT(3))
#define LP_IOMUX_REG_PAD1_RUE_M  (LP_IOMUX_REG_PAD1_RUE_V << LP_IOMUX_REG_PAD1_RUE_S)
#define LP_IOMUX_REG_PAD1_RUE_V  0x00000001U
#define LP_IOMUX_REG_PAD1_RUE_S  3
/** LP_IOMUX_REG_PAD1_MUX_SEL : R/W; bitpos: [4]; default: 0;
 *  1:use LP GPIO,0: use digital GPIO
 */
#define LP_IOMUX_REG_PAD1_MUX_SEL    (BIT(4))
#define LP_IOMUX_REG_PAD1_MUX_SEL_M  (LP_IOMUX_REG_PAD1_MUX_SEL_V << LP_IOMUX_REG_PAD1_MUX_SEL_S)
#define LP_IOMUX_REG_PAD1_MUX_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD1_MUX_SEL_S  4
/** LP_IOMUX_REG_PAD1_FUN_SEL : R/W; bitpos: [6:5]; default: 0;
 *  function sel
 */
#define LP_IOMUX_REG_PAD1_FUN_SEL    0x00000003U
#define LP_IOMUX_REG_PAD1_FUN_SEL_M  (LP_IOMUX_REG_PAD1_FUN_SEL_V << LP_IOMUX_REG_PAD1_FUN_SEL_S)
#define LP_IOMUX_REG_PAD1_FUN_SEL_V  0x00000003U
#define LP_IOMUX_REG_PAD1_FUN_SEL_S  5
/** LP_IOMUX_REG_PAD1_SLP_SEL : R/W; bitpos: [7]; default: 0;
 *  1: enable sleep mode during sleep,0: no sleep mode
 */
#define LP_IOMUX_REG_PAD1_SLP_SEL    (BIT(7))
#define LP_IOMUX_REG_PAD1_SLP_SEL_M  (LP_IOMUX_REG_PAD1_SLP_SEL_V << LP_IOMUX_REG_PAD1_SLP_SEL_S)
#define LP_IOMUX_REG_PAD1_SLP_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD1_SLP_SEL_S  7
/** LP_IOMUX_REG_PAD1_SLP_IE : R/W; bitpos: [8]; default: 0;
 *  input enable in sleep mode
 */
#define LP_IOMUX_REG_PAD1_SLP_IE    (BIT(8))
#define LP_IOMUX_REG_PAD1_SLP_IE_M  (LP_IOMUX_REG_PAD1_SLP_IE_V << LP_IOMUX_REG_PAD1_SLP_IE_S)
#define LP_IOMUX_REG_PAD1_SLP_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD1_SLP_IE_S  8
/** LP_IOMUX_REG_PAD1_SLP_OE : R/W; bitpos: [9]; default: 0;
 *  output enable in sleep mode
 */
#define LP_IOMUX_REG_PAD1_SLP_OE    (BIT(9))
#define LP_IOMUX_REG_PAD1_SLP_OE_M  (LP_IOMUX_REG_PAD1_SLP_OE_V << LP_IOMUX_REG_PAD1_SLP_OE_S)
#define LP_IOMUX_REG_PAD1_SLP_OE_V  0x00000001U
#define LP_IOMUX_REG_PAD1_SLP_OE_S  9
/** LP_IOMUX_REG_PAD1_FUN_IE : R/W; bitpos: [10]; default: 0;
 *  input enable in work mode
 */
#define LP_IOMUX_REG_PAD1_FUN_IE    (BIT(10))
#define LP_IOMUX_REG_PAD1_FUN_IE_M  (LP_IOMUX_REG_PAD1_FUN_IE_V << LP_IOMUX_REG_PAD1_FUN_IE_S)
#define LP_IOMUX_REG_PAD1_FUN_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD1_FUN_IE_S  10
/** LP_IOMUX_REG_PAD1_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IOMUX_REG_PAD1_FILTER_EN    (BIT(11))
#define LP_IOMUX_REG_PAD1_FILTER_EN_M  (LP_IOMUX_REG_PAD1_FILTER_EN_V << LP_IOMUX_REG_PAD1_FILTER_EN_S)
#define LP_IOMUX_REG_PAD1_FILTER_EN_V  0x00000001U
#define LP_IOMUX_REG_PAD1_FILTER_EN_S  11

/** LP_IOMUX_PAD2_REG register
 *  Reserved
 */
#define LP_IOMUX_PAD2_REG (DR_REG_LP_IOMUX_BASE + 0x10)
/** LP_IOMUX_REG_PAD2_DRV : R/W; bitpos: [1:0]; default: 2;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD2_DRV    0x00000003U
#define LP_IOMUX_REG_PAD2_DRV_M  (LP_IOMUX_REG_PAD2_DRV_V << LP_IOMUX_REG_PAD2_DRV_S)
#define LP_IOMUX_REG_PAD2_DRV_V  0x00000003U
#define LP_IOMUX_REG_PAD2_DRV_S  0
/** LP_IOMUX_REG_PAD2_RDE : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD2_RDE    (BIT(2))
#define LP_IOMUX_REG_PAD2_RDE_M  (LP_IOMUX_REG_PAD2_RDE_V << LP_IOMUX_REG_PAD2_RDE_S)
#define LP_IOMUX_REG_PAD2_RDE_V  0x00000001U
#define LP_IOMUX_REG_PAD2_RDE_S  2
/** LP_IOMUX_REG_PAD2_RUE : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD2_RUE    (BIT(3))
#define LP_IOMUX_REG_PAD2_RUE_M  (LP_IOMUX_REG_PAD2_RUE_V << LP_IOMUX_REG_PAD2_RUE_S)
#define LP_IOMUX_REG_PAD2_RUE_V  0x00000001U
#define LP_IOMUX_REG_PAD2_RUE_S  3
/** LP_IOMUX_REG_PAD2_MUX_SEL : R/W; bitpos: [4]; default: 0;
 *  1:use LP GPIO,0: use digital GPIO
 */
#define LP_IOMUX_REG_PAD2_MUX_SEL    (BIT(4))
#define LP_IOMUX_REG_PAD2_MUX_SEL_M  (LP_IOMUX_REG_PAD2_MUX_SEL_V << LP_IOMUX_REG_PAD2_MUX_SEL_S)
#define LP_IOMUX_REG_PAD2_MUX_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD2_MUX_SEL_S  4
/** LP_IOMUX_REG_PAD2_FUN_SEL : R/W; bitpos: [6:5]; default: 0;
 *  function sel
 */
#define LP_IOMUX_REG_PAD2_FUN_SEL    0x00000003U
#define LP_IOMUX_REG_PAD2_FUN_SEL_M  (LP_IOMUX_REG_PAD2_FUN_SEL_V << LP_IOMUX_REG_PAD2_FUN_SEL_S)
#define LP_IOMUX_REG_PAD2_FUN_SEL_V  0x00000003U
#define LP_IOMUX_REG_PAD2_FUN_SEL_S  5
/** LP_IOMUX_REG_PAD2_SLP_SEL : R/W; bitpos: [7]; default: 0;
 *  1: enable sleep mode during sleep,0: no sleep mode
 */
#define LP_IOMUX_REG_PAD2_SLP_SEL    (BIT(7))
#define LP_IOMUX_REG_PAD2_SLP_SEL_M  (LP_IOMUX_REG_PAD2_SLP_SEL_V << LP_IOMUX_REG_PAD2_SLP_SEL_S)
#define LP_IOMUX_REG_PAD2_SLP_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD2_SLP_SEL_S  7
/** LP_IOMUX_REG_PAD2_SLP_IE : R/W; bitpos: [8]; default: 0;
 *  input enable in sleep mode
 */
#define LP_IOMUX_REG_PAD2_SLP_IE    (BIT(8))
#define LP_IOMUX_REG_PAD2_SLP_IE_M  (LP_IOMUX_REG_PAD2_SLP_IE_V << LP_IOMUX_REG_PAD2_SLP_IE_S)
#define LP_IOMUX_REG_PAD2_SLP_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD2_SLP_IE_S  8
/** LP_IOMUX_REG_PAD2_SLP_OE : R/W; bitpos: [9]; default: 0;
 *  output enable in sleep mode
 */
#define LP_IOMUX_REG_PAD2_SLP_OE    (BIT(9))
#define LP_IOMUX_REG_PAD2_SLP_OE_M  (LP_IOMUX_REG_PAD2_SLP_OE_V << LP_IOMUX_REG_PAD2_SLP_OE_S)
#define LP_IOMUX_REG_PAD2_SLP_OE_V  0x00000001U
#define LP_IOMUX_REG_PAD2_SLP_OE_S  9
/** LP_IOMUX_REG_PAD2_FUN_IE : R/W; bitpos: [10]; default: 0;
 *  input enable in work mode
 */
#define LP_IOMUX_REG_PAD2_FUN_IE    (BIT(10))
#define LP_IOMUX_REG_PAD2_FUN_IE_M  (LP_IOMUX_REG_PAD2_FUN_IE_V << LP_IOMUX_REG_PAD2_FUN_IE_S)
#define LP_IOMUX_REG_PAD2_FUN_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD2_FUN_IE_S  10
/** LP_IOMUX_REG_PAD2_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IOMUX_REG_PAD2_FILTER_EN    (BIT(11))
#define LP_IOMUX_REG_PAD2_FILTER_EN_M  (LP_IOMUX_REG_PAD2_FILTER_EN_V << LP_IOMUX_REG_PAD2_FILTER_EN_S)
#define LP_IOMUX_REG_PAD2_FILTER_EN_V  0x00000001U
#define LP_IOMUX_REG_PAD2_FILTER_EN_S  11

