espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_iomux_reg.h
/** LP_IOMUX_PAD3_REG register
 *  Reserved
 */
#define LP_IOMUX_PAD3_REG (DR_REG_LP_IOMUX_BASE + 0x14)
/** LP_IOMUX_REG_PAD3_DRV : R/W; bitpos: [1:0]; default: 2;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD3_DRV    0x00000003U
#define LP_IOMUX_REG_PAD3_DRV_M  (LP_IOMUX_REG_PAD3_DRV_V << LP_IOMUX_REG_PAD3_DRV_S)
#define LP_IOMUX_REG_PAD3_DRV_V  0x00000003U
#define LP_IOMUX_REG_PAD3_DRV_S  0
/** LP_IOMUX_REG_PAD3_RDE : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD3_RDE    (BIT(2))
#define LP_IOMUX_REG_PAD3_RDE_M  (LP_IOMUX_REG_PAD3_RDE_V << LP_IOMUX_REG_PAD3_RDE_S)
#define LP_IOMUX_REG_PAD3_RDE_V  0x00000001U
#define LP_IOMUX_REG_PAD3_RDE_S  2
/** LP_IOMUX_REG_PAD3_RUE : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD3_RUE    (BIT(3))
#define LP_IOMUX_REG_PAD3_RUE_M  (LP_IOMUX_REG_PAD3_RUE_V << LP_IOMUX_REG_PAD3_RUE_S)
#define LP_IOMUX_REG_PAD3_RUE_V  0x00000001U
#define LP_IOMUX_REG_PAD3_RUE_S  3
/** LP_IOMUX_REG_PAD3_MUX_SEL : R/W; bitpos: [4]; default: 0;
 *  1:use LP GPIO,0: use digital GPIO
 */
#define LP_IOMUX_REG_PAD3_MUX_SEL    (BIT(4))
#define LP_IOMUX_REG_PAD3_MUX_SEL_M  (LP_IOMUX_REG_PAD3_MUX_SEL_V << LP_IOMUX_REG_PAD3_MUX_SEL_S)
#define LP_IOMUX_REG_PAD3_MUX_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD3_MUX_SEL_S  4
/** LP_IOMUX_REG_PAD3_FUN_SEL : R/W; bitpos: [6:5]; default: 0;
 *  function sel
 */
#define LP_IOMUX_REG_PAD3_FUN_SEL    0x00000003U
#define LP_IOMUX_REG_PAD3_FUN_SEL_M  (LP_IOMUX_REG_PAD3_FUN_SEL_V << LP_IOMUX_REG_PAD3_FUN_SEL_S)
#define LP_IOMUX_REG_PAD3_FUN_SEL_V  0x00000003U
#define LP_IOMUX_REG_PAD3_FUN_SEL_S  5
/** LP_IOMUX_REG_PAD3_SLP_SEL : R/W; bitpos: [7]; default: 0;
 *  1: enable sleep mode during sleep,0: no sleep mode
 */
#define LP_IOMUX_REG_PAD3_SLP_SEL    (BIT(7))
#define LP_IOMUX_REG_PAD3_SLP_SEL_M  (LP_IOMUX_REG_PAD3_SLP_SEL_V << LP_IOMUX_REG_PAD3_SLP_SEL_S)
#define LP_IOMUX_REG_PAD3_SLP_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD3_SLP_SEL_S  7
/** LP_IOMUX_REG_PAD3_SLP_IE : R/W; bitpos: [8]; default: 0;
 *  input enable in sleep mode
 */
#define LP_IOMUX_REG_PAD3_SLP_IE    (BIT(8))
#define LP_IOMUX_REG_PAD3_SLP_IE_M  (LP_IOMUX_REG_PAD3_SLP_IE_V << LP_IOMUX_REG_PAD3_SLP_IE_S)
#define LP_IOMUX_REG_PAD3_SLP_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD3_SLP_IE_S  8
/** LP_IOMUX_REG_PAD3_SLP_OE : R/W; bitpos: [9]; default: 0;
 *  output enable in sleep mode
 */
#define LP_IOMUX_REG_PAD3_SLP_OE    (BIT(9))
#define LP_IOMUX_REG_PAD3_SLP_OE_M  (LP_IOMUX_REG_PAD3_SLP_OE_V << LP_IOMUX_REG_PAD3_SLP_OE_S)
#define LP_IOMUX_REG_PAD3_SLP_OE_V  0x00000001U
#define LP_IOMUX_REG_PAD3_SLP_OE_S  9
/** LP_IOMUX_REG_PAD3_FUN_IE : R/W; bitpos: [10]; default: 0;
 *  input enable in work mode
 */
#define LP_IOMUX_REG_PAD3_FUN_IE    (BIT(10))
#define LP_IOMUX_REG_PAD3_FUN_IE_M  (LP_IOMUX_REG_PAD3_FUN_IE_V << LP_IOMUX_REG_PAD3_FUN_IE_S)
#define LP_IOMUX_REG_PAD3_FUN_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD3_FUN_IE_S  10
/** LP_IOMUX_REG_PAD3_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IOMUX_REG_PAD3_FILTER_EN    (BIT(11))
#define LP_IOMUX_REG_PAD3_FILTER_EN_M  (LP_IOMUX_REG_PAD3_FILTER_EN_V << LP_IOMUX_REG_PAD3_FILTER_EN_S)
#define LP_IOMUX_REG_PAD3_FILTER_EN_V  0x00000001U
#define LP_IOMUX_REG_PAD3_FILTER_EN_S  11

/** LP_IOMUX_PAD4_REG register
 *  Reserved
 */
#define LP_IOMUX_PAD4_REG (DR_REG_LP_IOMUX_BASE + 0x18)
/** LP_IOMUX_REG_PAD4_DRV : R/W; bitpos: [1:0]; default: 2;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD4_DRV    0x00000003U
#define LP_IOMUX_REG_PAD4_DRV_M  (LP_IOMUX_REG_PAD4_DRV_V << LP_IOMUX_REG_PAD4_DRV_S)
#define LP_IOMUX_REG_PAD4_DRV_V  0x00000003U
#define LP_IOMUX_REG_PAD4_DRV_S  0
/** LP_IOMUX_REG_PAD4_RDE : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD4_RDE    (BIT(2))
#define LP_IOMUX_REG_PAD4_RDE_M  (LP_IOMUX_REG_PAD4_RDE_V << LP_IOMUX_REG_PAD4_RDE_S)
#define LP_IOMUX_REG_PAD4_RDE_V  0x00000001U
#define LP_IOMUX_REG_PAD4_RDE_S  2
/** LP_IOMUX_REG_PAD4_RUE : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD4_RUE    (BIT(3))
#define LP_IOMUX_REG_PAD4_RUE_M  (LP_IOMUX_REG_PAD4_RUE_V << LP_IOMUX_REG_PAD4_RUE_S)
#define LP_IOMUX_REG_PAD4_RUE_V  0x00000001U
#define LP_IOMUX_REG_PAD4_RUE_S  3
/** LP_IOMUX_REG_PAD4_MUX_SEL : R/W; bitpos: [4]; default: 0;
 *  1:use LP GPIO,0: use digital GPIO
 */
#define LP_IOMUX_REG_PAD4_MUX_SEL    (BIT(4))
#define LP_IOMUX_REG_PAD4_MUX_SEL_M  (LP_IOMUX_REG_PAD4_MUX_SEL_V << LP_IOMUX_REG_PAD4_MUX_SEL_S)
#define LP_IOMUX_REG_PAD4_MUX_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD4_MUX_SEL_S  4
/** LP_IOMUX_REG_PAD4_FUN_SEL : R/W; bitpos: [6:5]; default: 0;
 *  function sel
 */
#define LP_IOMUX_REG_PAD4_FUN_SEL    0x00000003U
#define LP_IOMUX_REG_PAD4_FUN_SEL_M  (LP_IOMUX_REG_PAD4_FUN_SEL_V << LP_IOMUX_REG_PAD4_FUN_SEL_S)
#define LP_IOMUX_REG_PAD4_FUN_SEL_V  0x00000003U
#define LP_IOMUX_REG_PAD4_FUN_SEL_S  5
/** LP_IOMUX_REG_PAD4_SLP_SEL : R/W; bitpos: [7]; default: 0;
 *  1: enable sleep mode during sleep,0: no sleep mode
 */
#define LP_IOMUX_REG_PAD4_SLP_SEL    (BIT(7))
#define LP_IOMUX_REG_PAD4_SLP_SEL_M  (LP_IOMUX_REG_PAD4_SLP_SEL_V << LP_IOMUX_REG_PAD4_SLP_SEL_S)
#define LP_IOMUX_REG_PAD4_SLP_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD4_SLP_SEL_S  7
/** LP_IOMUX_REG_PAD4_SLP_IE : R/W; bitpos: [8]; default: 0;
 *  input enable in sleep mode
 */
#define LP_IOMUX_REG_PAD4_SLP_IE    (BIT(8))
#define LP_IOMUX_REG_PAD4_SLP_IE_M  (LP_IOMUX_REG_PAD4_SLP_IE_V << LP_IOMUX_REG_PAD4_SLP_IE_S)
#define LP_IOMUX_REG_PAD4_SLP_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD4_SLP_IE_S  8
/** LP_IOMUX_REG_PAD4_SLP_OE : R/W; bitpos: [9]; default: 0;
 *  output enable in sleep mode
 */
#define LP_IOMUX_REG_PAD4_SLP_OE    (BIT(9))
#define LP_IOMUX_REG_PAD4_SLP_OE_M  (LP_IOMUX_REG_PAD4_SLP_OE_V << LP_IOMUX_REG_PAD4_SLP_OE_S)
#define LP_IOMUX_REG_PAD4_SLP_OE_V  0x00000001U
#define LP_IOMUX_REG_PAD4_SLP_OE_S  9
/** LP_IOMUX_REG_PAD4_FUN_IE : R/W; bitpos: [10]; default: 0;
 *  input enable in work mode
 */
#define LP_IOMUX_REG_PAD4_FUN_IE    (BIT(10))
#define LP_IOMUX_REG_PAD4_FUN_IE_M  (LP_IOMUX_REG_PAD4_FUN_IE_V << LP_IOMUX_REG_PAD4_FUN_IE_S)
#define LP_IOMUX_REG_PAD4_FUN_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD4_FUN_IE_S  10
/** LP_IOMUX_REG_PAD4_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IOMUX_REG_PAD4_FILTER_EN    (BIT(11))
#define LP_IOMUX_REG_PAD4_FILTER_EN_M  (LP_IOMUX_REG_PAD4_FILTER_EN_V << LP_IOMUX_REG_PAD4_FILTER_EN_S)
#define LP_IOMUX_REG_PAD4_FILTER_EN_V  0x00000001U
#define LP_IOMUX_REG_PAD4_FILTER_EN_S  11

/** LP_IOMUX_PAD5_REG register
 *  Reserved
 */
#define LP_IOMUX_PAD5_REG (DR_REG_LP_IOMUX_BASE + 0x1c)
/** LP_IOMUX_REG_PAD5_DRV : R/W; bitpos: [1:0]; default: 2;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD5_DRV    0x00000003U
#define LP_IOMUX_REG_PAD5_DRV_M  (LP_IOMUX_REG_PAD5_DRV_V << LP_IOMUX_REG_PAD5_DRV_S)
#define LP_IOMUX_REG_PAD5_DRV_V  0x00000003U
#define LP_IOMUX_REG_PAD5_DRV_S  0
/** LP_IOMUX_REG_PAD5_RDE : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD5_RDE    (BIT(2))
#define LP_IOMUX_REG_PAD5_RDE_M  (LP_IOMUX_REG_PAD5_RDE_V << LP_IOMUX_REG_PAD5_RDE_S)
#define LP_IOMUX_REG_PAD5_RDE_V  0x00000001U
#define LP_IOMUX_REG_PAD5_RDE_S  2
/** LP_IOMUX_REG_PAD5_RUE : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD5_RUE    (BIT(3))
#define LP_IOMUX_REG_PAD5_RUE_M  (LP_IOMUX_REG_PAD5_RUE_V << LP_IOMUX_REG_PAD5_RUE_S)
#define LP_IOMUX_REG_PAD5_RUE_V  0x00000001U
#define LP_IOMUX_REG_PAD5_RUE_S  3
/** LP_IOMUX_REG_PAD5_MUX_SEL : R/W; bitpos: [4]; default: 0;
 *  1:use LP GPIO,0: use digital GPIO
 */
#define LP_IOMUX_REG_PAD5_MUX_SEL    (BIT(4))
#define LP_IOMUX_REG_PAD5_MUX_SEL_M  (LP_IOMUX_REG_PAD5_MUX_SEL_V << LP_IOMUX_REG_PAD5_MUX_SEL_S)
#define LP_IOMUX_REG_PAD5_MUX_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD5_MUX_SEL_S  4
/** LP_IOMUX_REG_PAD5_FUN_SEL : R/W; bitpos: [6:5]; default: 0;
 *  function sel
 */
#define LP_IOMUX_REG_PAD5_FUN_SEL    0x00000003U
#define LP_IOMUX_REG_PAD5_FUN_SEL_M  (LP_IOMUX_REG_PAD5_FUN_SEL_V << LP_IOMUX_REG_PAD5_FUN_SEL_S)
#define LP_IOMUX_REG_PAD5_FUN_SEL_V  0x00000003U
#define LP_IOMUX_REG_PAD5_FUN_SEL_S  5
/** LP_IOMUX_REG_PAD5_SLP_SEL : R/W; bitpos: [7]; default: 0;
 *  1: enable sleep mode during sleep,0: no sleep mode
 */
#define LP_IOMUX_REG_PAD5_SLP_SEL    (BIT(7))
#define LP_IOMUX_REG_PAD5_SLP_SEL_M  (LP_IOMUX_REG_PAD5_SLP_SEL_V << LP_IOMUX_REG_PAD5_SLP_SEL_S)
#define LP_IOMUX_REG_PAD5_SLP_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD5_SLP_SEL_S  7
/** LP_IOMUX_REG_PAD5_SLP_IE : R/W; bitpos: [8]; default: 0;
 *  input enable in sleep mode
 */
#define LP_IOMUX_REG_PAD5_SLP_IE    (BIT(8))
#define LP_IOMUX_REG_PAD5_SLP_IE_M  (LP_IOMUX_REG_PAD5_SLP_IE_V << LP_IOMUX_REG_PAD5_SLP_IE_S)
#define LP_IOMUX_REG_PAD5_SLP_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD5_SLP_IE_S  8
/** LP_IOMUX_REG_PAD5_SLP_OE : R/W; bitpos: [9]; default: 0;
 *  output enable in sleep mode
 */
#define LP_IOMUX_REG_PAD5_SLP_OE    (BIT(9))
#define LP_IOMUX_REG_PAD5_SLP_OE_M  (LP_IOMUX_REG_PAD5_SLP_OE_V << LP_IOMUX_REG_PAD5_SLP_OE_S)
#define LP_IOMUX_REG_PAD5_SLP_OE_V  0x00000001U
#define LP_IOMUX_REG_PAD5_SLP_OE_S  9
/** LP_IOMUX_REG_PAD5_FUN_IE : R/W; bitpos: [10]; default: 0;
 *  input enable in work mode
 */
#define LP_IOMUX_REG_PAD5_FUN_IE    (BIT(10))
#define LP_IOMUX_REG_PAD5_FUN_IE_M  (LP_IOMUX_REG_PAD5_FUN_IE_V << LP_IOMUX_REG_PAD5_FUN_IE_S)
#define LP_IOMUX_REG_PAD5_FUN_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD5_FUN_IE_S  10
/** LP_IOMUX_REG_PAD5_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IOMUX_REG_PAD5_FILTER_EN    (BIT(11))
#define LP_IOMUX_REG_PAD5_FILTER_EN_M  (LP_IOMUX_REG_PAD5_FILTER_EN_V << LP_IOMUX_REG_PAD5_FILTER_EN_S)
#define LP_IOMUX_REG_PAD5_FILTER_EN_V  0x00000001U
#define LP_IOMUX_REG_PAD5_FILTER_EN_S  11

/** LP_IOMUX_PAD6_REG register
 *  Reserved
 */
#define LP_IOMUX_PAD6_REG (DR_REG_LP_IOMUX_BASE + 0x20)
/** LP_IOMUX_REG_PAD6_DRV : R/W; bitpos: [1:0]; default: 2;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD6_DRV    0x00000003U
#define LP_IOMUX_REG_PAD6_DRV_M  (LP_IOMUX_REG_PAD6_DRV_V << LP_IOMUX_REG_PAD6_DRV_S)
#define LP_IOMUX_REG_PAD6_DRV_V  0x00000003U
#define LP_IOMUX_REG_PAD6_DRV_S  0
/** LP_IOMUX_REG_PAD6_RDE : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD6_RDE    (BIT(2))
#define LP_IOMUX_REG_PAD6_RDE_M  (LP_IOMUX_REG_PAD6_RDE_V << LP_IOMUX_REG_PAD6_RDE_S)
#define LP_IOMUX_REG_PAD6_RDE_V  0x00000001U
#define LP_IOMUX_REG_PAD6_RDE_S  2
/** LP_IOMUX_REG_PAD6_RUE : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD6_RUE    (BIT(3))
#define LP_IOMUX_REG_PAD6_RUE_M  (LP_IOMUX_REG_PAD6_RUE_V << LP_IOMUX_REG_PAD6_RUE_S)
#define LP_IOMUX_REG_PAD6_RUE_V  0x00000001U
#define LP_IOMUX_REG_PAD6_RUE_S  3
/** LP_IOMUX_REG_PAD6_MUX_SEL : R/W; bitpos: [4]; default: 0;
 *  1:use LP GPIO,0: use digital GPIO
 */
#define LP_IOMUX_REG_PAD6_MUX_SEL    (BIT(4))
#define LP_IOMUX_REG_PAD6_MUX_SEL_M  (LP_IOMUX_REG_PAD6_MUX_SEL_V << LP_IOMUX_REG_PAD6_MUX_SEL_S)
#define LP_IOMUX_REG_PAD6_MUX_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD6_MUX_SEL_S  4
/** LP_IOMUX_REG_PAD6_FUN_SEL : R/W; bitpos: [6:5]; default: 0;
 *  function sel
 */
#define LP_IOMUX_REG_PAD6_FUN_SEL    0x00000003U
#define LP_IOMUX_REG_PAD6_FUN_SEL_M  (LP_IOMUX_REG_PAD6_FUN_SEL_V << LP_IOMUX_REG_PAD6_FUN_SEL_S)
#define LP_IOMUX_REG_PAD6_FUN_SEL_V  0x00000003U
#define LP_IOMUX_REG_PAD6_FUN_SEL_S  5
/** LP_IOMUX_REG_PAD6_SLP_SEL : R/W; bitpos: [7]; default: 0;
 *  1: enable sleep mode during sleep,0: no sleep mode
 */
#define LP_IOMUX_REG_PAD6_SLP_SEL    (BIT(7))
#define LP_IOMUX_REG_PAD6_SLP_SEL_M  (LP_IOMUX_REG_PAD6_SLP_SEL_V << LP_IOMUX_REG_PAD6_SLP_SEL_S)
#define LP_IOMUX_REG_PAD6_SLP_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD6_SLP_SEL_S  7
/** LP_IOMUX_REG_PAD6_SLP_IE : R/W; bitpos: [8]; default: 0;
 *  input enable in sleep mode
 */
#define LP_IOMUX_REG_PAD6_SLP_IE    (BIT(8))
#define LP_IOMUX_REG_PAD6_SLP_IE_M  (LP_IOMUX_REG_PAD6_SLP_IE_V << LP_IOMUX_REG_PAD6_SLP_IE_S)
#define LP_IOMUX_REG_PAD6_SLP_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD6_SLP_IE_S  8
/** LP_IOMUX_REG_PAD6_SLP_OE : R/W; bitpos: [9]; default: 0;
 *  output enable in sleep mode
 */
#define LP_IOMUX_REG_PAD6_SLP_OE    (BIT(9))
#define LP_IOMUX_REG_PAD6_SLP_OE_M  (LP_IOMUX_REG_PAD6_SLP_OE_V << LP_IOMUX_REG_PAD6_SLP_OE_S)
#define LP_IOMUX_REG_PAD6_SLP_OE_V  0x00000001U
#define LP_IOMUX_REG_PAD6_SLP_OE_S  9
/** LP_IOMUX_REG_PAD6_FUN_IE : R/W; bitpos: [10]; default: 0;
 *  input enable in work mode
 */
#define LP_IOMUX_REG_PAD6_FUN_IE    (BIT(10))
#define LP_IOMUX_REG_PAD6_FUN_IE_M  (LP_IOMUX_REG_PAD6_FUN_IE_V << LP_IOMUX_REG_PAD6_FUN_IE_S)
#define LP_IOMUX_REG_PAD6_FUN_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD6_FUN_IE_S  10
/** LP_IOMUX_REG_PAD6_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IOMUX_REG_PAD6_FILTER_EN    (BIT(11))
#define LP_IOMUX_REG_PAD6_FILTER_EN_M  (LP_IOMUX_REG_PAD6_FILTER_EN_V << LP_IOMUX_REG_PAD6_FILTER_EN_S)
#define LP_IOMUX_REG_PAD6_FILTER_EN_V  0x00000001U
#define LP_IOMUX_REG_PAD6_FILTER_EN_S  11

/** LP_IOMUX_PAD7_REG register
 *  Reserved
 */
#define LP_IOMUX_PAD7_REG (DR_REG_LP_IOMUX_BASE + 0x24)
/** LP_IOMUX_REG_PAD7_DRV : R/W; bitpos: [1:0]; default: 2;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD7_DRV    0x00000003U
#define LP_IOMUX_REG_PAD7_DRV_M  (LP_IOMUX_REG_PAD7_DRV_V << LP_IOMUX_REG_PAD7_DRV_S)
#define LP_IOMUX_REG_PAD7_DRV_V  0x00000003U
#define LP_IOMUX_REG_PAD7_DRV_S  0
/** LP_IOMUX_REG_PAD7_RDE : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD7_RDE    (BIT(2))
#define LP_IOMUX_REG_PAD7_RDE_M  (LP_IOMUX_REG_PAD7_RDE_V << LP_IOMUX_REG_PAD7_RDE_S)
#define LP_IOMUX_REG_PAD7_RDE_V  0x00000001U
#define LP_IOMUX_REG_PAD7_RDE_S  2
/** LP_IOMUX_REG_PAD7_RUE : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD7_RUE    (BIT(3))
#define LP_IOMUX_REG_PAD7_RUE_M  (LP_IOMUX_REG_PAD7_RUE_V << LP_IOMUX_REG_PAD7_RUE_S)
#define LP_IOMUX_REG_PAD7_RUE_V  0x00000001U
#define LP_IOMUX_REG_PAD7_RUE_S  3
/** LP_IOMUX_REG_PAD7_MUX_SEL : R/W; bitpos: [4]; default: 0;
 *  1:use LP GPIO,0: use digital GPIO
 */
#define LP_IOMUX_REG_PAD7_MUX_SEL    (BIT(4))
#define LP_IOMUX_REG_PAD7_MUX_SEL_M  (LP_IOMUX_REG_PAD7_MUX_SEL_V << LP_IOMUX_REG_PAD7_MUX_SEL_S)
#define LP_IOMUX_REG_PAD7_MUX_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD7_MUX_SEL_S  4
/** LP_IOMUX_REG_PAD7_FUN_SEL : R/W; bitpos: [6:5]; default: 0;
 *  function sel
 */
#define LP_IOMUX_REG_PAD7_FUN_SEL    0x00000003U
#define LP_IOMUX_REG_PAD7_FUN_SEL_M  (LP_IOMUX_REG_PAD7_FUN_SEL_V << LP_IOMUX_REG_PAD7_FUN_SEL_S)
#define LP_IOMUX_REG_PAD7_FUN_SEL_V  0x00000003U
#define LP_IOMUX_REG_PAD7_FUN_SEL_S  5
/** LP_IOMUX_REG_PAD7_SLP_SEL : R/W; bitpos: [7]; default: 0;
 *  1: enable sleep mode during sleep,0: no sleep mode
 */
#define LP_IOMUX_REG_PAD7_SLP_SEL    (BIT(7))
#define LP_IOMUX_REG_PAD7_SLP_SEL_M  (LP_IOMUX_REG_PAD7_SLP_SEL_V << LP_IOMUX_REG_PAD7_SLP_SEL_S)
#define LP_IOMUX_REG_PAD7_SLP_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD7_SLP_SEL_S  7
/** LP_IOMUX_REG_PAD7_SLP_IE : R/W; bitpos: [8]; default: 0;
 *  input enable in sleep mode
 */
#define LP_IOMUX_REG_PAD7_SLP_IE    (BIT(8))
#define LP_IOMUX_REG_PAD7_SLP_IE_M  (LP_IOMUX_REG_PAD7_SLP_IE_V << LP_IOMUX_REG_PAD7_SLP_IE_S)
#define LP_IOMUX_REG_PAD7_SLP_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD7_SLP_IE_S  8
/** LP_IOMUX_REG_PAD7_SLP_OE : R/W; bitpos: [9]; default: 0;
 *  output enable in sleep mode
 */
#define LP_IOMUX_REG_PAD7_SLP_OE    (BIT(9))
#define LP_IOMUX_REG_PAD7_SLP_OE_M  (LP_IOMUX_REG_PAD7_SLP_OE_V << LP_IOMUX_REG_PAD7_SLP_OE_S)
#define LP_IOMUX_REG_PAD7_SLP_OE_V  0x00000001U
#define LP_IOMUX_REG_PAD7_SLP_OE_S  9
/** LP_IOMUX_REG_PAD7_FUN_IE : R/W; bitpos: [10]; default: 0;
 *  input enable in work mode
 */
#define LP_IOMUX_REG_PAD7_FUN_IE    (BIT(10))
#define LP_IOMUX_REG_PAD7_FUN_IE_M  (LP_IOMUX_REG_PAD7_FUN_IE_V << LP_IOMUX_REG_PAD7_FUN_IE_S)
#define LP_IOMUX_REG_PAD7_FUN_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD7_FUN_IE_S  10
/** LP_IOMUX_REG_PAD7_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IOMUX_REG_PAD7_FILTER_EN    (BIT(11))
#define LP_IOMUX_REG_PAD7_FILTER_EN_M  (LP_IOMUX_REG_PAD7_FILTER_EN_V << LP_IOMUX_REG_PAD7_FILTER_EN_S)
#define LP_IOMUX_REG_PAD7_FILTER_EN_V  0x00000001U
#define LP_IOMUX_REG_PAD7_FILTER_EN_S  11

/** LP_IOMUX_PAD8_REG register
 *  Reserved
 */
#define LP_IOMUX_PAD8_REG (DR_REG_LP_IOMUX_BASE + 0x28)
/** LP_IOMUX_REG_PAD8_DRV : R/W; bitpos: [1:0]; default: 2;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD8_DRV    0x00000003U
#define LP_IOMUX_REG_PAD8_DRV_M  (LP_IOMUX_REG_PAD8_DRV_V << LP_IOMUX_REG_PAD8_DRV_S)
#define LP_IOMUX_REG_PAD8_DRV_V  0x00000003U
#define LP_IOMUX_REG_PAD8_DRV_S  0
/** LP_IOMUX_REG_PAD8_RDE : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD8_RDE    (BIT(2))
#define LP_IOMUX_REG_PAD8_RDE_M  (LP_IOMUX_REG_PAD8_RDE_V << LP_IOMUX_REG_PAD8_RDE_S)
#define LP_IOMUX_REG_PAD8_RDE_V  0x00000001U
#define LP_IOMUX_REG_PAD8_RDE_S  2
/** LP_IOMUX_REG_PAD8_RUE : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD8_RUE    (BIT(3))
#define LP_IOMUX_REG_PAD8_RUE_M  (LP_IOMUX_REG_PAD8_RUE_V << LP_IOMUX_REG_PAD8_RUE_S)
#define LP_IOMUX_REG_PAD8_RUE_V  0x00000001U
#define LP_IOMUX_REG_PAD8_RUE_S  3
/** LP_IOMUX_REG_PAD8_MUX_SEL : R/W; bitpos: [4]; default: 0;
 *  1:use LP GPIO,0: use digital GPIO
 */
#define LP_IOMUX_REG_PAD8_MUX_SEL    (BIT(4))
#define LP_IOMUX_REG_PAD8_MUX_SEL_M  (LP_IOMUX_REG_PAD8_MUX_SEL_V << LP_IOMUX_REG_PAD8_MUX_SEL_S)
#define LP_IOMUX_REG_PAD8_MUX_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD8_MUX_SEL_S  4
/** LP_IOMUX_REG_PAD8_FUN_SEL : R/W; bitpos: [6:5]; default: 0;
 *  function sel
 */
#define LP_IOMUX_REG_PAD8_FUN_SEL    0x00000003U
#define LP_IOMUX_REG_PAD8_FUN_SEL_M  (LP_IOMUX_REG_PAD8_FUN_SEL_V << LP_IOMUX_REG_PAD8_FUN_SEL_S)
#define LP_IOMUX_REG_PAD8_FUN_SEL_V  0x00000003U
#define LP_IOMUX_REG_PAD8_FUN_SEL_S  5
/** LP_IOMUX_REG_PAD8_SLP_SEL : R/W; bitpos: [7]; default: 0;
 *  1: enable sleep mode during sleep,0: no sleep mode
 */
#define LP_IOMUX_REG_PAD8_SLP_SEL    (BIT(7))
#define LP_IOMUX_REG_PAD8_SLP_SEL_M  (LP_IOMUX_REG_PAD8_SLP_SEL_V << LP_IOMUX_REG_PAD8_SLP_SEL_S)
#define LP_IOMUX_REG_PAD8_SLP_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD8_SLP_SEL_S  7
/** LP_IOMUX_REG_PAD8_SLP_IE : R/W; bitpos: [8]; default: 0;
 *  input enable in sleep mode
 */
#define LP_IOMUX_REG_PAD8_SLP_IE    (BIT(8))
#define LP_IOMUX_REG_PAD8_SLP_IE_M  (LP_IOMUX_REG_PAD8_SLP_IE_V << LP_IOMUX_REG_PAD8_SLP_IE_S)
#define LP_IOMUX_REG_PAD8_SLP_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD8_SLP_IE_S  8
/** LP_IOMUX_REG_PAD8_SLP_OE : R/W; bitpos: [9]; default: 0;
 *  output enable in sleep mode
 */
#define LP_IOMUX_REG_PAD8_SLP_OE    (BIT(9))
#define LP_IOMUX_REG_PAD8_SLP_OE_M  (LP_IOMUX_REG_PAD8_SLP_OE_V << LP_IOMUX_REG_PAD8_SLP_OE_S)
#define LP_IOMUX_REG_PAD8_SLP_OE_V  0x00000001U
#define LP_IOMUX_REG_PAD8_SLP_OE_S  9
/** LP_IOMUX_REG_PAD8_FUN_IE : R/W; bitpos: [10]; default: 0;
 *  input enable in work mode
 */
#define LP_IOMUX_REG_PAD8_FUN_IE    (BIT(10))
#define LP_IOMUX_REG_PAD8_FUN_IE_M  (LP_IOMUX_REG_PAD8_FUN_IE_V << LP_IOMUX_REG_PAD8_FUN_IE_S)
#define LP_IOMUX_REG_PAD8_FUN_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD8_FUN_IE_S  10
/** LP_IOMUX_REG_PAD8_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IOMUX_REG_PAD8_FILTER_EN    (BIT(11))
#define LP_IOMUX_REG_PAD8_FILTER_EN_M  (LP_IOMUX_REG_PAD8_FILTER_EN_V << LP_IOMUX_REG_PAD8_FILTER_EN_S)
#define LP_IOMUX_REG_PAD8_FILTER_EN_V  0x00000001U
#define LP_IOMUX_REG_PAD8_FILTER_EN_S  11

/** LP_IOMUX_PAD9_REG register
 *  Reserved
 */
#define LP_IOMUX_PAD9_REG (DR_REG_LP_IOMUX_BASE + 0x2c)
/** LP_IOMUX_REG_PAD9_DRV : R/W; bitpos: [1:0]; default: 2;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD9_DRV    0x00000003U
#define LP_IOMUX_REG_PAD9_DRV_M  (LP_IOMUX_REG_PAD9_DRV_V << LP_IOMUX_REG_PAD9_DRV_S)
#define LP_IOMUX_REG_PAD9_DRV_V  0x00000003U
#define LP_IOMUX_REG_PAD9_DRV_S  0
/** LP_IOMUX_REG_PAD9_RDE : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD9_RDE    (BIT(2))
#define LP_IOMUX_REG_PAD9_RDE_M  (LP_IOMUX_REG_PAD9_RDE_V << LP_IOMUX_REG_PAD9_RDE_S)
#define LP_IOMUX_REG_PAD9_RDE_V  0x00000001U
#define LP_IOMUX_REG_PAD9_RDE_S  2
/** LP_IOMUX_REG_PAD9_RUE : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD9_RUE    (BIT(3))
#define LP_IOMUX_REG_PAD9_RUE_M  (LP_IOMUX_REG_PAD9_RUE_V << LP_IOMUX_REG_PAD9_RUE_S)
#define LP_IOMUX_REG_PAD9_RUE_V  0x00000001U
#define LP_IOMUX_REG_PAD9_RUE_S  3
/** LP_IOMUX_REG_PAD9_MUX_SEL : R/W; bitpos: [4]; default: 0;
 *  1:use LP GPIO,0: use digital GPIO
 */
#define LP_IOMUX_REG_PAD9_MUX_SEL    (BIT(4))
#define LP_IOMUX_REG_PAD9_MUX_SEL_M  (LP_IOMUX_REG_PAD9_MUX_SEL_V << LP_IOMUX_REG_PAD9_MUX_SEL_S)
#define LP_IOMUX_REG_PAD9_MUX_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD9_MUX_SEL_S  4
/** LP_IOMUX_REG_PAD9_FUN_SEL : R/W; bitpos: [6:5]; default: 0;
 *  function sel
 */
#define LP_IOMUX_REG_PAD9_FUN_SEL    0x00000003U
#define LP_IOMUX_REG_PAD9_FUN_SEL_M  (LP_IOMUX_REG_PAD9_FUN_SEL_V << LP_IOMUX_REG_PAD9_FUN_SEL_S)
#define LP_IOMUX_REG_PAD9_FUN_SEL_V  0x00000003U
#define LP_IOMUX_REG_PAD9_FUN_SEL_S  5
/** LP_IOMUX_REG_PAD9_SLP_SEL : R/W; bitpos: [7]; default: 0;
 *  1: enable sleep mode during sleep,0: no sleep mode
 */
#define LP_IOMUX_REG_PAD9_SLP_SEL    (BIT(7))
#define LP_IOMUX_REG_PAD9_SLP_SEL_M  (LP_IOMUX_REG_PAD9_SLP_SEL_V << LP_IOMUX_REG_PAD9_SLP_SEL_S)
#define LP_IOMUX_REG_PAD9_SLP_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD9_SLP_SEL_S  7
/** LP_IOMUX_REG_PAD9_SLP_IE : R/W; bitpos: [8]; default: 0;
 *  input enable in sleep mode
 */
#define LP_IOMUX_REG_PAD9_SLP_IE    (BIT(8))
#define LP_IOMUX_REG_PAD9_SLP_IE_M  (LP_IOMUX_REG_PAD9_SLP_IE_V << LP_IOMUX_REG_PAD9_SLP_IE_S)
#define LP_IOMUX_REG_PAD9_SLP_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD9_SLP_IE_S  8
/** LP_IOMUX_REG_PAD9_SLP_OE : R/W; bitpos: [9]; default: 0;
 *  output enable in sleep mode
 */
#define LP_IOMUX_REG_PAD9_SLP_OE    (BIT(9))
#define LP_IOMUX_REG_PAD9_SLP_OE_M  (LP_IOMUX_REG_PAD9_SLP_OE_V << LP_IOMUX_REG_PAD9_SLP_OE_S)
#define LP_IOMUX_REG_PAD9_SLP_OE_V  0x00000001U
#define LP_IOMUX_REG_PAD9_SLP_OE_S  9
/** LP_IOMUX_REG_PAD9_FUN_IE : R/W; bitpos: [10]; default: 0;
 *  input enable in work mode
 */
#define LP_IOMUX_REG_PAD9_FUN_IE    (BIT(10))
#define LP_IOMUX_REG_PAD9_FUN_IE_M  (LP_IOMUX_REG_PAD9_FUN_IE_V << LP_IOMUX_REG_PAD9_FUN_IE_S)
#define LP_IOMUX_REG_PAD9_FUN_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD9_FUN_IE_S  10
/** LP_IOMUX_REG_PAD9_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IOMUX_REG_PAD9_FILTER_EN    (BIT(11))
#define LP_IOMUX_REG_PAD9_FILTER_EN_M  (LP_IOMUX_REG_PAD9_FILTER_EN_V << LP_IOMUX_REG_PAD9_FILTER_EN_S)
#define LP_IOMUX_REG_PAD9_FILTER_EN_V  0x00000001U
#define LP_IOMUX_REG_PAD9_FILTER_EN_S  11

