espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_iomux_reg.h
/** LP_IOMUX_PAD10_REG register
 *  Reserved
 */
#define LP_IOMUX_PAD10_REG (DR_REG_LP_IOMUX_BASE + 0x30)
/** LP_IOMUX_REG_PAD10_DRV : R/W; bitpos: [1:0]; default: 2;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD10_DRV    0x00000003U
#define LP_IOMUX_REG_PAD10_DRV_M  (LP_IOMUX_REG_PAD10_DRV_V << LP_IOMUX_REG_PAD10_DRV_S)
#define LP_IOMUX_REG_PAD10_DRV_V  0x00000003U
#define LP_IOMUX_REG_PAD10_DRV_S  0
/** LP_IOMUX_REG_PAD10_RDE : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD10_RDE    (BIT(2))
#define LP_IOMUX_REG_PAD10_RDE_M  (LP_IOMUX_REG_PAD10_RDE_V << LP_IOMUX_REG_PAD10_RDE_S)
#define LP_IOMUX_REG_PAD10_RDE_V  0x00000001U
#define LP_IOMUX_REG_PAD10_RDE_S  2
/** LP_IOMUX_REG_PAD10_RUE : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD10_RUE    (BIT(3))
#define LP_IOMUX_REG_PAD10_RUE_M  (LP_IOMUX_REG_PAD10_RUE_V << LP_IOMUX_REG_PAD10_RUE_S)
#define LP_IOMUX_REG_PAD10_RUE_V  0x00000001U
#define LP_IOMUX_REG_PAD10_RUE_S  3
/** LP_IOMUX_REG_PAD10_MUX_SEL : R/W; bitpos: [4]; default: 0;
 *  1:use LP GPIO,0: use digital GPIO
 */
#define LP_IOMUX_REG_PAD10_MUX_SEL    (BIT(4))
#define LP_IOMUX_REG_PAD10_MUX_SEL_M  (LP_IOMUX_REG_PAD10_MUX_SEL_V << LP_IOMUX_REG_PAD10_MUX_SEL_S)
#define LP_IOMUX_REG_PAD10_MUX_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD10_MUX_SEL_S  4
/** LP_IOMUX_REG_PAD10_FUN_SEL : R/W; bitpos: [6:5]; default: 0;
 *  function sel
 */
#define LP_IOMUX_REG_PAD10_FUN_SEL    0x00000003U
#define LP_IOMUX_REG_PAD10_FUN_SEL_M  (LP_IOMUX_REG_PAD10_FUN_SEL_V << LP_IOMUX_REG_PAD10_FUN_SEL_S)
#define LP_IOMUX_REG_PAD10_FUN_SEL_V  0x00000003U
#define LP_IOMUX_REG_PAD10_FUN_SEL_S  5
/** LP_IOMUX_REG_PAD10_SLP_SEL : R/W; bitpos: [7]; default: 0;
 *  1: enable sleep mode during sleep,0: no sleep mode
 */
#define LP_IOMUX_REG_PAD10_SLP_SEL    (BIT(7))
#define LP_IOMUX_REG_PAD10_SLP_SEL_M  (LP_IOMUX_REG_PAD10_SLP_SEL_V << LP_IOMUX_REG_PAD10_SLP_SEL_S)
#define LP_IOMUX_REG_PAD10_SLP_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD10_SLP_SEL_S  7
/** LP_IOMUX_REG_PAD10_SLP_IE : R/W; bitpos: [8]; default: 0;
 *  input enable in sleep mode
 */
#define LP_IOMUX_REG_PAD10_SLP_IE    (BIT(8))
#define LP_IOMUX_REG_PAD10_SLP_IE_M  (LP_IOMUX_REG_PAD10_SLP_IE_V << LP_IOMUX_REG_PAD10_SLP_IE_S)
#define LP_IOMUX_REG_PAD10_SLP_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD10_SLP_IE_S  8
/** LP_IOMUX_REG_PAD10_SLP_OE : R/W; bitpos: [9]; default: 0;
 *  output enable in sleep mode
 */
#define LP_IOMUX_REG_PAD10_SLP_OE    (BIT(9))
#define LP_IOMUX_REG_PAD10_SLP_OE_M  (LP_IOMUX_REG_PAD10_SLP_OE_V << LP_IOMUX_REG_PAD10_SLP_OE_S)
#define LP_IOMUX_REG_PAD10_SLP_OE_V  0x00000001U
#define LP_IOMUX_REG_PAD10_SLP_OE_S  9
/** LP_IOMUX_REG_PAD10_FUN_IE : R/W; bitpos: [10]; default: 0;
 *  input enable in work mode
 */
#define LP_IOMUX_REG_PAD10_FUN_IE    (BIT(10))
#define LP_IOMUX_REG_PAD10_FUN_IE_M  (LP_IOMUX_REG_PAD10_FUN_IE_V << LP_IOMUX_REG_PAD10_FUN_IE_S)
#define LP_IOMUX_REG_PAD10_FUN_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD10_FUN_IE_S  10
/** LP_IOMUX_REG_PAD10_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IOMUX_REG_PAD10_FILTER_EN    (BIT(11))
#define LP_IOMUX_REG_PAD10_FILTER_EN_M  (LP_IOMUX_REG_PAD10_FILTER_EN_V << LP_IOMUX_REG_PAD10_FILTER_EN_S)
#define LP_IOMUX_REG_PAD10_FILTER_EN_V  0x00000001U
#define LP_IOMUX_REG_PAD10_FILTER_EN_S  11

/** LP_IOMUX_PAD11_REG register
 *  Reserved
 */
#define LP_IOMUX_PAD11_REG (DR_REG_LP_IOMUX_BASE + 0x34)
/** LP_IOMUX_REG_PAD11_DRV : R/W; bitpos: [1:0]; default: 2;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD11_DRV    0x00000003U
#define LP_IOMUX_REG_PAD11_DRV_M  (LP_IOMUX_REG_PAD11_DRV_V << LP_IOMUX_REG_PAD11_DRV_S)
#define LP_IOMUX_REG_PAD11_DRV_V  0x00000003U
#define LP_IOMUX_REG_PAD11_DRV_S  0
/** LP_IOMUX_REG_PAD11_RDE : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD11_RDE    (BIT(2))
#define LP_IOMUX_REG_PAD11_RDE_M  (LP_IOMUX_REG_PAD11_RDE_V << LP_IOMUX_REG_PAD11_RDE_S)
#define LP_IOMUX_REG_PAD11_RDE_V  0x00000001U
#define LP_IOMUX_REG_PAD11_RDE_S  2
/** LP_IOMUX_REG_PAD11_RUE : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD11_RUE    (BIT(3))
#define LP_IOMUX_REG_PAD11_RUE_M  (LP_IOMUX_REG_PAD11_RUE_V << LP_IOMUX_REG_PAD11_RUE_S)
#define LP_IOMUX_REG_PAD11_RUE_V  0x00000001U
#define LP_IOMUX_REG_PAD11_RUE_S  3
/** LP_IOMUX_REG_PAD11_MUX_SEL : R/W; bitpos: [4]; default: 0;
 *  1:use LP GPIO,0: use digital GPIO
 */
#define LP_IOMUX_REG_PAD11_MUX_SEL    (BIT(4))
#define LP_IOMUX_REG_PAD11_MUX_SEL_M  (LP_IOMUX_REG_PAD11_MUX_SEL_V << LP_IOMUX_REG_PAD11_MUX_SEL_S)
#define LP_IOMUX_REG_PAD11_MUX_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD11_MUX_SEL_S  4
/** LP_IOMUX_REG_PAD11_FUN_SEL : R/W; bitpos: [6:5]; default: 0;
 *  function sel
 */
#define LP_IOMUX_REG_PAD11_FUN_SEL    0x00000003U
#define LP_IOMUX_REG_PAD11_FUN_SEL_M  (LP_IOMUX_REG_PAD11_FUN_SEL_V << LP_IOMUX_REG_PAD11_FUN_SEL_S)
#define LP_IOMUX_REG_PAD11_FUN_SEL_V  0x00000003U
#define LP_IOMUX_REG_PAD11_FUN_SEL_S  5
/** LP_IOMUX_REG_PAD11_SLP_SEL : R/W; bitpos: [7]; default: 0;
 *  1: enable sleep mode during sleep,0: no sleep mode
 */
#define LP_IOMUX_REG_PAD11_SLP_SEL    (BIT(7))
#define LP_IOMUX_REG_PAD11_SLP_SEL_M  (LP_IOMUX_REG_PAD11_SLP_SEL_V << LP_IOMUX_REG_PAD11_SLP_SEL_S)
#define LP_IOMUX_REG_PAD11_SLP_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD11_SLP_SEL_S  7
/** LP_IOMUX_REG_PAD11_SLP_IE : R/W; bitpos: [8]; default: 0;
 *  input enable in sleep mode
 */
#define LP_IOMUX_REG_PAD11_SLP_IE    (BIT(8))
#define LP_IOMUX_REG_PAD11_SLP_IE_M  (LP_IOMUX_REG_PAD11_SLP_IE_V << LP_IOMUX_REG_PAD11_SLP_IE_S)
#define LP_IOMUX_REG_PAD11_SLP_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD11_SLP_IE_S  8
/** LP_IOMUX_REG_PAD11_SLP_OE : R/W; bitpos: [9]; default: 0;
 *  output enable in sleep mode
 */
#define LP_IOMUX_REG_PAD11_SLP_OE    (BIT(9))
#define LP_IOMUX_REG_PAD11_SLP_OE_M  (LP_IOMUX_REG_PAD11_SLP_OE_V << LP_IOMUX_REG_PAD11_SLP_OE_S)
#define LP_IOMUX_REG_PAD11_SLP_OE_V  0x00000001U
#define LP_IOMUX_REG_PAD11_SLP_OE_S  9
/** LP_IOMUX_REG_PAD11_FUN_IE : R/W; bitpos: [10]; default: 0;
 *  input enable in work mode
 */
#define LP_IOMUX_REG_PAD11_FUN_IE    (BIT(10))
#define LP_IOMUX_REG_PAD11_FUN_IE_M  (LP_IOMUX_REG_PAD11_FUN_IE_V << LP_IOMUX_REG_PAD11_FUN_IE_S)
#define LP_IOMUX_REG_PAD11_FUN_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD11_FUN_IE_S  10
/** LP_IOMUX_REG_PAD11_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IOMUX_REG_PAD11_FILTER_EN    (BIT(11))
#define LP_IOMUX_REG_PAD11_FILTER_EN_M  (LP_IOMUX_REG_PAD11_FILTER_EN_V << LP_IOMUX_REG_PAD11_FILTER_EN_S)
#define LP_IOMUX_REG_PAD11_FILTER_EN_V  0x00000001U
#define LP_IOMUX_REG_PAD11_FILTER_EN_S  11

/** LP_IOMUX_PAD120_REG register
 *  Reserved
 */
#define LP_IOMUX_PAD120_REG (DR_REG_LP_IOMUX_BASE + 0x38)
/** LP_IOMUX_REG_PAD12_DRV : R/W; bitpos: [1:0]; default: 2;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD12_DRV    0x00000003U
#define LP_IOMUX_REG_PAD12_DRV_M  (LP_IOMUX_REG_PAD12_DRV_V << LP_IOMUX_REG_PAD12_DRV_S)
#define LP_IOMUX_REG_PAD12_DRV_V  0x00000003U
#define LP_IOMUX_REG_PAD12_DRV_S  0
/** LP_IOMUX_REG_PAD12_RDE : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD12_RDE    (BIT(2))
#define LP_IOMUX_REG_PAD12_RDE_M  (LP_IOMUX_REG_PAD12_RDE_V << LP_IOMUX_REG_PAD12_RDE_S)
#define LP_IOMUX_REG_PAD12_RDE_V  0x00000001U
#define LP_IOMUX_REG_PAD12_RDE_S  2
/** LP_IOMUX_REG_PAD12_RUE : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD12_RUE    (BIT(3))
#define LP_IOMUX_REG_PAD12_RUE_M  (LP_IOMUX_REG_PAD12_RUE_V << LP_IOMUX_REG_PAD12_RUE_S)
#define LP_IOMUX_REG_PAD12_RUE_V  0x00000001U
#define LP_IOMUX_REG_PAD12_RUE_S  3
/** LP_IOMUX_REG_PAD12_MUX_SEL : R/W; bitpos: [4]; default: 0;
 *  1:use LP GPIO,0: use digital GPIO
 */
#define LP_IOMUX_REG_PAD12_MUX_SEL    (BIT(4))
#define LP_IOMUX_REG_PAD12_MUX_SEL_M  (LP_IOMUX_REG_PAD12_MUX_SEL_V << LP_IOMUX_REG_PAD12_MUX_SEL_S)
#define LP_IOMUX_REG_PAD12_MUX_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD12_MUX_SEL_S  4
/** LP_IOMUX_REG_PAD12_FUN_SEL : R/W; bitpos: [6:5]; default: 0;
 *  function sel
 */
#define LP_IOMUX_REG_PAD12_FUN_SEL    0x00000003U
#define LP_IOMUX_REG_PAD12_FUN_SEL_M  (LP_IOMUX_REG_PAD12_FUN_SEL_V << LP_IOMUX_REG_PAD12_FUN_SEL_S)
#define LP_IOMUX_REG_PAD12_FUN_SEL_V  0x00000003U
#define LP_IOMUX_REG_PAD12_FUN_SEL_S  5
/** LP_IOMUX_REG_PAD12_SLP_SEL : R/W; bitpos: [7]; default: 0;
 *  1: enable sleep mode during sleep,0: no sleep mode
 */
#define LP_IOMUX_REG_PAD12_SLP_SEL    (BIT(7))
#define LP_IOMUX_REG_PAD12_SLP_SEL_M  (LP_IOMUX_REG_PAD12_SLP_SEL_V << LP_IOMUX_REG_PAD12_SLP_SEL_S)
#define LP_IOMUX_REG_PAD12_SLP_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD12_SLP_SEL_S  7
/** LP_IOMUX_REG_PAD12_SLP_IE : R/W; bitpos: [8]; default: 0;
 *  input enable in sleep mode
 */
#define LP_IOMUX_REG_PAD12_SLP_IE    (BIT(8))
#define LP_IOMUX_REG_PAD12_SLP_IE_M  (LP_IOMUX_REG_PAD12_SLP_IE_V << LP_IOMUX_REG_PAD12_SLP_IE_S)
#define LP_IOMUX_REG_PAD12_SLP_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD12_SLP_IE_S  8
/** LP_IOMUX_REG_PAD12_SLP_OE : R/W; bitpos: [9]; default: 0;
 *  output enable in sleep mode
 */
#define LP_IOMUX_REG_PAD12_SLP_OE    (BIT(9))
#define LP_IOMUX_REG_PAD12_SLP_OE_M  (LP_IOMUX_REG_PAD12_SLP_OE_V << LP_IOMUX_REG_PAD12_SLP_OE_S)
#define LP_IOMUX_REG_PAD12_SLP_OE_V  0x00000001U
#define LP_IOMUX_REG_PAD12_SLP_OE_S  9
/** LP_IOMUX_REG_PAD12_FUN_IE : R/W; bitpos: [10]; default: 0;
 *  input enable in work mode
 */
#define LP_IOMUX_REG_PAD12_FUN_IE    (BIT(10))
#define LP_IOMUX_REG_PAD12_FUN_IE_M  (LP_IOMUX_REG_PAD12_FUN_IE_V << LP_IOMUX_REG_PAD12_FUN_IE_S)
#define LP_IOMUX_REG_PAD12_FUN_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD12_FUN_IE_S  10
/** LP_IOMUX_REG_PAD12_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IOMUX_REG_PAD12_FILTER_EN    (BIT(11))
#define LP_IOMUX_REG_PAD12_FILTER_EN_M  (LP_IOMUX_REG_PAD12_FILTER_EN_V << LP_IOMUX_REG_PAD12_FILTER_EN_S)
#define LP_IOMUX_REG_PAD12_FILTER_EN_V  0x00000001U
#define LP_IOMUX_REG_PAD12_FILTER_EN_S  11

