espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_iomux_reg.h
/** LP_IOMUX_PAD13_REG register
 *  Reserved
 */
#define LP_IOMUX_PAD13_REG (DR_REG_LP_IOMUX_BASE + 0x3c)
/** LP_IOMUX_REG_PAD13_DRV : R/W; bitpos: [1:0]; default: 2;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD13_DRV    0x00000003U
#define LP_IOMUX_REG_PAD13_DRV_M  (LP_IOMUX_REG_PAD13_DRV_V << LP_IOMUX_REG_PAD13_DRV_S)
#define LP_IOMUX_REG_PAD13_DRV_V  0x00000003U
#define LP_IOMUX_REG_PAD13_DRV_S  0
/** LP_IOMUX_REG_PAD13_RDE : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD13_RDE    (BIT(2))
#define LP_IOMUX_REG_PAD13_RDE_M  (LP_IOMUX_REG_PAD13_RDE_V << LP_IOMUX_REG_PAD13_RDE_S)
#define LP_IOMUX_REG_PAD13_RDE_V  0x00000001U
#define LP_IOMUX_REG_PAD13_RDE_S  2
/** LP_IOMUX_REG_PAD13_RUE : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD13_RUE    (BIT(3))
#define LP_IOMUX_REG_PAD13_RUE_M  (LP_IOMUX_REG_PAD13_RUE_V << LP_IOMUX_REG_PAD13_RUE_S)
#define LP_IOMUX_REG_PAD13_RUE_V  0x00000001U
#define LP_IOMUX_REG_PAD13_RUE_S  3
/** LP_IOMUX_REG_PAD13_MUX_SEL : R/W; bitpos: [4]; default: 0;
 *  1:use LP GPIO,0: use digital GPIO
 */
#define LP_IOMUX_REG_PAD13_MUX_SEL    (BIT(4))
#define LP_IOMUX_REG_PAD13_MUX_SEL_M  (LP_IOMUX_REG_PAD13_MUX_SEL_V << LP_IOMUX_REG_PAD13_MUX_SEL_S)
#define LP_IOMUX_REG_PAD13_MUX_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD13_MUX_SEL_S  4
/** LP_IOMUX_REG_PAD13_FUN_SEL : R/W; bitpos: [6:5]; default: 0;
 *  function sel
 */
#define LP_IOMUX_REG_PAD13_FUN_SEL    0x00000003U
#define LP_IOMUX_REG_PAD13_FUN_SEL_M  (LP_IOMUX_REG_PAD13_FUN_SEL_V << LP_IOMUX_REG_PAD13_FUN_SEL_S)
#define LP_IOMUX_REG_PAD13_FUN_SEL_V  0x00000003U
#define LP_IOMUX_REG_PAD13_FUN_SEL_S  5
/** LP_IOMUX_REG_PAD13_SLP_SEL : R/W; bitpos: [7]; default: 0;
 *  1: enable sleep mode during sleep,0: no sleep mode
 */
#define LP_IOMUX_REG_PAD13_SLP_SEL    (BIT(7))
#define LP_IOMUX_REG_PAD13_SLP_SEL_M  (LP_IOMUX_REG_PAD13_SLP_SEL_V << LP_IOMUX_REG_PAD13_SLP_SEL_S)
#define LP_IOMUX_REG_PAD13_SLP_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD13_SLP_SEL_S  7
/** LP_IOMUX_REG_PAD13_SLP_IE : R/W; bitpos: [8]; default: 0;
 *  input enable in sleep mode
 */
#define LP_IOMUX_REG_PAD13_SLP_IE    (BIT(8))
#define LP_IOMUX_REG_PAD13_SLP_IE_M  (LP_IOMUX_REG_PAD13_SLP_IE_V << LP_IOMUX_REG_PAD13_SLP_IE_S)
#define LP_IOMUX_REG_PAD13_SLP_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD13_SLP_IE_S  8
/** LP_IOMUX_REG_PAD13_SLP_OE : R/W; bitpos: [9]; default: 0;
 *  output enable in sleep mode
 */
#define LP_IOMUX_REG_PAD13_SLP_OE    (BIT(9))
#define LP_IOMUX_REG_PAD13_SLP_OE_M  (LP_IOMUX_REG_PAD13_SLP_OE_V << LP_IOMUX_REG_PAD13_SLP_OE_S)
#define LP_IOMUX_REG_PAD13_SLP_OE_V  0x00000001U
#define LP_IOMUX_REG_PAD13_SLP_OE_S  9
/** LP_IOMUX_REG_PAD13_FUN_IE : R/W; bitpos: [10]; default: 0;
 *  input enable in work mode
 */
#define LP_IOMUX_REG_PAD13_FUN_IE    (BIT(10))
#define LP_IOMUX_REG_PAD13_FUN_IE_M  (LP_IOMUX_REG_PAD13_FUN_IE_V << LP_IOMUX_REG_PAD13_FUN_IE_S)
#define LP_IOMUX_REG_PAD13_FUN_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD13_FUN_IE_S  10
/** LP_IOMUX_REG_PAD13_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IOMUX_REG_PAD13_FILTER_EN    (BIT(11))
#define LP_IOMUX_REG_PAD13_FILTER_EN_M  (LP_IOMUX_REG_PAD13_FILTER_EN_V << LP_IOMUX_REG_PAD13_FILTER_EN_S)
#define LP_IOMUX_REG_PAD13_FILTER_EN_V  0x00000001U
#define LP_IOMUX_REG_PAD13_FILTER_EN_S  11

/** LP_IOMUX_PAD14_REG register
 *  Reserved
 */
#define LP_IOMUX_PAD14_REG (DR_REG_LP_IOMUX_BASE + 0x40)
/** LP_IOMUX_REG_PAD14_DRV : R/W; bitpos: [1:0]; default: 2;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD14_DRV    0x00000003U
#define LP_IOMUX_REG_PAD14_DRV_M  (LP_IOMUX_REG_PAD14_DRV_V << LP_IOMUX_REG_PAD14_DRV_S)
#define LP_IOMUX_REG_PAD14_DRV_V  0x00000003U
#define LP_IOMUX_REG_PAD14_DRV_S  0
/** LP_IOMUX_REG_PAD14_RDE : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD14_RDE    (BIT(2))
#define LP_IOMUX_REG_PAD14_RDE_M  (LP_IOMUX_REG_PAD14_RDE_V << LP_IOMUX_REG_PAD14_RDE_S)
#define LP_IOMUX_REG_PAD14_RDE_V  0x00000001U
#define LP_IOMUX_REG_PAD14_RDE_S  2
/** LP_IOMUX_REG_PAD14_RUE : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD14_RUE    (BIT(3))
#define LP_IOMUX_REG_PAD14_RUE_M  (LP_IOMUX_REG_PAD14_RUE_V << LP_IOMUX_REG_PAD14_RUE_S)
#define LP_IOMUX_REG_PAD14_RUE_V  0x00000001U
#define LP_IOMUX_REG_PAD14_RUE_S  3
/** LP_IOMUX_REG_PAD14_MUX_SEL : R/W; bitpos: [4]; default: 0;
 *  1:use LP GPIO,0: use digital GPIO
 */
#define LP_IOMUX_REG_PAD14_MUX_SEL    (BIT(4))
#define LP_IOMUX_REG_PAD14_MUX_SEL_M  (LP_IOMUX_REG_PAD14_MUX_SEL_V << LP_IOMUX_REG_PAD14_MUX_SEL_S)
#define LP_IOMUX_REG_PAD14_MUX_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD14_MUX_SEL_S  4
/** LP_IOMUX_REG_PAD14_FUN_SEL : R/W; bitpos: [6:5]; default: 0;
 *  function sel
 */
#define LP_IOMUX_REG_PAD14_FUN_SEL    0x00000003U
#define LP_IOMUX_REG_PAD14_FUN_SEL_M  (LP_IOMUX_REG_PAD14_FUN_SEL_V << LP_IOMUX_REG_PAD14_FUN_SEL_S)
#define LP_IOMUX_REG_PAD14_FUN_SEL_V  0x00000003U
#define LP_IOMUX_REG_PAD14_FUN_SEL_S  5
/** LP_IOMUX_REG_PAD14_SLP_SEL : R/W; bitpos: [7]; default: 0;
 *  1: enable sleep mode during sleep,0: no sleep mode
 */
#define LP_IOMUX_REG_PAD14_SLP_SEL    (BIT(7))
#define LP_IOMUX_REG_PAD14_SLP_SEL_M  (LP_IOMUX_REG_PAD14_SLP_SEL_V << LP_IOMUX_REG_PAD14_SLP_SEL_S)
#define LP_IOMUX_REG_PAD14_SLP_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD14_SLP_SEL_S  7
/** LP_IOMUX_REG_PAD14_SLP_IE : R/W; bitpos: [8]; default: 0;
 *  input enable in sleep mode
 */
#define LP_IOMUX_REG_PAD14_SLP_IE    (BIT(8))
#define LP_IOMUX_REG_PAD14_SLP_IE_M  (LP_IOMUX_REG_PAD14_SLP_IE_V << LP_IOMUX_REG_PAD14_SLP_IE_S)
#define LP_IOMUX_REG_PAD14_SLP_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD14_SLP_IE_S  8
/** LP_IOMUX_REG_PAD14_SLP_OE : R/W; bitpos: [9]; default: 0;
 *  output enable in sleep mode
 */
#define LP_IOMUX_REG_PAD14_SLP_OE    (BIT(9))
#define LP_IOMUX_REG_PAD14_SLP_OE_M  (LP_IOMUX_REG_PAD14_SLP_OE_V << LP_IOMUX_REG_PAD14_SLP_OE_S)
#define LP_IOMUX_REG_PAD14_SLP_OE_V  0x00000001U
#define LP_IOMUX_REG_PAD14_SLP_OE_S  9
/** LP_IOMUX_REG_PAD14_FUN_IE : R/W; bitpos: [10]; default: 0;
 *  input enable in work mode
 */
#define LP_IOMUX_REG_PAD14_FUN_IE    (BIT(10))
#define LP_IOMUX_REG_PAD14_FUN_IE_M  (LP_IOMUX_REG_PAD14_FUN_IE_V << LP_IOMUX_REG_PAD14_FUN_IE_S)
#define LP_IOMUX_REG_PAD14_FUN_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD14_FUN_IE_S  10
/** LP_IOMUX_REG_PAD14_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IOMUX_REG_PAD14_FILTER_EN    (BIT(11))
#define LP_IOMUX_REG_PAD14_FILTER_EN_M  (LP_IOMUX_REG_PAD14_FILTER_EN_V << LP_IOMUX_REG_PAD14_FILTER_EN_S)
#define LP_IOMUX_REG_PAD14_FILTER_EN_V  0x00000001U
#define LP_IOMUX_REG_PAD14_FILTER_EN_S  11

/** LP_IOMUX_PAD15_REG register
 *  Reserved
 */
#define LP_IOMUX_PAD15_REG (DR_REG_LP_IOMUX_BASE + 0x44)
/** LP_IOMUX_REG_PAD15_DRV : R/W; bitpos: [1:0]; default: 2;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD15_DRV    0x00000003U
#define LP_IOMUX_REG_PAD15_DRV_M  (LP_IOMUX_REG_PAD15_DRV_V << LP_IOMUX_REG_PAD15_DRV_S)
#define LP_IOMUX_REG_PAD15_DRV_V  0x00000003U
#define LP_IOMUX_REG_PAD15_DRV_S  0
/** LP_IOMUX_REG_PAD15_RDE : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD15_RDE    (BIT(2))
#define LP_IOMUX_REG_PAD15_RDE_M  (LP_IOMUX_REG_PAD15_RDE_V << LP_IOMUX_REG_PAD15_RDE_S)
#define LP_IOMUX_REG_PAD15_RDE_V  0x00000001U
#define LP_IOMUX_REG_PAD15_RDE_S  2
/** LP_IOMUX_REG_PAD15_RUE : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_PAD15_RUE    (BIT(3))
#define LP_IOMUX_REG_PAD15_RUE_M  (LP_IOMUX_REG_PAD15_RUE_V << LP_IOMUX_REG_PAD15_RUE_S)
#define LP_IOMUX_REG_PAD15_RUE_V  0x00000001U
#define LP_IOMUX_REG_PAD15_RUE_S  3
/** LP_IOMUX_REG_PAD15_MUX_SEL : R/W; bitpos: [4]; default: 0;
 *  1:use LP GPIO,0: use digital GPIO
 */
#define LP_IOMUX_REG_PAD15_MUX_SEL    (BIT(4))
#define LP_IOMUX_REG_PAD15_MUX_SEL_M  (LP_IOMUX_REG_PAD15_MUX_SEL_V << LP_IOMUX_REG_PAD15_MUX_SEL_S)
#define LP_IOMUX_REG_PAD15_MUX_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD15_MUX_SEL_S  4
/** LP_IOMUX_REG_PAD15_FUN_SEL : R/W; bitpos: [6:5]; default: 0;
 *  function sel
 */
#define LP_IOMUX_REG_PAD15_FUN_SEL    0x00000003U
#define LP_IOMUX_REG_PAD15_FUN_SEL_M  (LP_IOMUX_REG_PAD15_FUN_SEL_V << LP_IOMUX_REG_PAD15_FUN_SEL_S)
#define LP_IOMUX_REG_PAD15_FUN_SEL_V  0x00000003U
#define LP_IOMUX_REG_PAD15_FUN_SEL_S  5
/** LP_IOMUX_REG_PAD15_SLP_SEL : R/W; bitpos: [7]; default: 0;
 *  1: enable sleep mode during sleep,0: no sleep mode
 */
#define LP_IOMUX_REG_PAD15_SLP_SEL    (BIT(7))
#define LP_IOMUX_REG_PAD15_SLP_SEL_M  (LP_IOMUX_REG_PAD15_SLP_SEL_V << LP_IOMUX_REG_PAD15_SLP_SEL_S)
#define LP_IOMUX_REG_PAD15_SLP_SEL_V  0x00000001U
#define LP_IOMUX_REG_PAD15_SLP_SEL_S  7
/** LP_IOMUX_REG_PAD15_SLP_IE : R/W; bitpos: [8]; default: 0;
 *  input enable in sleep mode
 */
#define LP_IOMUX_REG_PAD15_SLP_IE    (BIT(8))
#define LP_IOMUX_REG_PAD15_SLP_IE_M  (LP_IOMUX_REG_PAD15_SLP_IE_V << LP_IOMUX_REG_PAD15_SLP_IE_S)
#define LP_IOMUX_REG_PAD15_SLP_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD15_SLP_IE_S  8
/** LP_IOMUX_REG_PAD15_SLP_OE : R/W; bitpos: [9]; default: 0;
 *  output enable in sleep mode
 */
#define LP_IOMUX_REG_PAD15_SLP_OE    (BIT(9))
#define LP_IOMUX_REG_PAD15_SLP_OE_M  (LP_IOMUX_REG_PAD15_SLP_OE_V << LP_IOMUX_REG_PAD15_SLP_OE_S)
#define LP_IOMUX_REG_PAD15_SLP_OE_V  0x00000001U
#define LP_IOMUX_REG_PAD15_SLP_OE_S  9
/** LP_IOMUX_REG_PAD15_FUN_IE : R/W; bitpos: [10]; default: 0;
 *  input enable in work mode
 */
#define LP_IOMUX_REG_PAD15_FUN_IE    (BIT(10))
#define LP_IOMUX_REG_PAD15_FUN_IE_M  (LP_IOMUX_REG_PAD15_FUN_IE_V << LP_IOMUX_REG_PAD15_FUN_IE_S)
#define LP_IOMUX_REG_PAD15_FUN_IE_V  0x00000001U
#define LP_IOMUX_REG_PAD15_FUN_IE_S  10
/** LP_IOMUX_REG_PAD15_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IOMUX_REG_PAD15_FILTER_EN    (BIT(11))
#define LP_IOMUX_REG_PAD15_FILTER_EN_M  (LP_IOMUX_REG_PAD15_FILTER_EN_V << LP_IOMUX_REG_PAD15_FILTER_EN_S)
#define LP_IOMUX_REG_PAD15_FILTER_EN_V  0x00000001U
#define LP_IOMUX_REG_PAD15_FILTER_EN_S  11

/** LP_IOMUX_EXT_WAKEUP0_SEL_REG register
 *  Reserved
 */
#define LP_IOMUX_EXT_WAKEUP0_SEL_REG (DR_REG_LP_IOMUX_BASE + 0x48)
/** LP_IOMUX_REG_XTL_EXT_CTR_SEL : R/W; bitpos: [4:0]; default: 0;
 *  select LP GPIO 0 ~ 15 to control XTAL
 */
#define LP_IOMUX_REG_XTL_EXT_CTR_SEL    0x0000001FU
#define LP_IOMUX_REG_XTL_EXT_CTR_SEL_M  (LP_IOMUX_REG_XTL_EXT_CTR_SEL_V << LP_IOMUX_REG_XTL_EXT_CTR_SEL_S)
#define LP_IOMUX_REG_XTL_EXT_CTR_SEL_V  0x0000001FU
#define LP_IOMUX_REG_XTL_EXT_CTR_SEL_S  0
/** LP_IOMUX_REG_EXT_WAKEUP0_SEL : R/W; bitpos: [9:5]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_EXT_WAKEUP0_SEL    0x0000001FU
#define LP_IOMUX_REG_EXT_WAKEUP0_SEL_M  (LP_IOMUX_REG_EXT_WAKEUP0_SEL_V << LP_IOMUX_REG_EXT_WAKEUP0_SEL_S)
#define LP_IOMUX_REG_EXT_WAKEUP0_SEL_V  0x0000001FU
#define LP_IOMUX_REG_EXT_WAKEUP0_SEL_S  5

/** LP_IOMUX_LP_PAD_HOLD_REG register
 *  Reserved
 */
#define LP_IOMUX_LP_PAD_HOLD_REG (DR_REG_LP_IOMUX_BASE + 0x4c)
/** LP_IOMUX_REG_LP_GPIO_HOLD : R/W; bitpos: [15:0]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_LP_GPIO_HOLD    0x0000FFFFU
#define LP_IOMUX_REG_LP_GPIO_HOLD_M  (LP_IOMUX_REG_LP_GPIO_HOLD_V << LP_IOMUX_REG_LP_GPIO_HOLD_S)
#define LP_IOMUX_REG_LP_GPIO_HOLD_V  0x0000FFFFU
#define LP_IOMUX_REG_LP_GPIO_HOLD_S  0

/** LP_IOMUX_LP_PAD_HYS_REG register
 *  Reserved
 */
#define LP_IOMUX_LP_PAD_HYS_REG (DR_REG_LP_IOMUX_BASE + 0x50)
/** LP_IOMUX_REG_LP_GPIO_HYS : R/W; bitpos: [15:0]; default: 0;
 *  Reserved
 */
#define LP_IOMUX_REG_LP_GPIO_HYS    0x0000FFFFU
#define LP_IOMUX_REG_LP_GPIO_HYS_M  (LP_IOMUX_REG_LP_GPIO_HYS_V << LP_IOMUX_REG_LP_GPIO_HYS_S)
#define LP_IOMUX_REG_LP_GPIO_HYS_V  0x0000FFFFU
#define LP_IOMUX_REG_LP_GPIO_HYS_S  0

#ifdef __cplusplus
}
#endif
